melonromanholidaycat/electriclight/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Partitions. See firmware/partitions/ for why the layout matters more than
# anything else in this file: it is the one thing a cable is needed to change.
#
# 4 MB is the default because that is what the boards in hand are. Build for a
# 16 MB module with:
#   idf.py -DSDKCONFIG_DEFAULTS="sdkconfig.defaults;sdkconfig.16mb" build
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/4mb.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# A new image must prove itself before it is trusted. Without this an OTA that
# boots and then wedges is permanent, and the guitar is closed.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Serve the embedded page and accept an upload over the same server.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# Optimise for size rather than debuggability. There is no debugger on the
# finished instrument and no serial port to attach one to, so the smaller image
# is worth more than the easier backtrace - and it is worth most of all on a
# 4 MB module, where the app slots are half the size.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# There is no serial monitor on the finished instrument, so the log that matters
# is the one served over HTTP. Keep the level useful rather than minimal.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
